---
title: PlanTopologySet
classe: Autodesk.Revit.DB.PlanTopologySet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# PlanTopologySet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `planTopologySet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `planTopologySet.Size` | Int32 |
| `Void Clear()` | `planTopologySet.Clear()` | Void |
| `Boolean Contains(PlanTopology)` | `planTopologySet.Contains(item)` | Boolean |
| `Int32 Erase(PlanTopology)` | `planTopologySet.Erase(item)` | Int32 |
| `PlanTopologySetIterator ForwardIterator()` | `planTopologySet.ForwardIterator()` | PlanTopologySetIterator |
| `IEnumerator GetEnumerator()` | `planTopologySet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(PlanTopology)` | `planTopologySet.Insert(item)` | Boolean |
| `PlanTopologySetIterator ReverseIterator()` | `planTopologySet.ReverseIterator()` | PlanTopologySetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```